              + origin = "primary"
              + weight = 1
            }
        }

        origins {
            http_port  = 8000
            https_port = 4443
            label      = "primary"
            uri        = "130.61.200.157"

            custom_headers {
                name  = "user"
                value = "student"
            }
        }

      ~ policy_config {
            certificate_id                = "ocid1.waascertificate.oc1..aaaaaaaao4fg75q3ftv3dui6h4ttds52cpi3ktn6zo5b6xu4vivatqhvr5ka"
          + cipher_group                  = "DEFAULT"
            client_address_header         = "X_FORWARDED_FOR"
            is_behind_cdn                 = false
          ~ is_cache_control_respected    = false -> true
            is_https_enabled              = true
            is_https_forced               = true
            is_origin_compression_enabled = false
            is_response_buffering_enabled = false
          ~ tls_protocols                 = [
              + "TLS_V1",
              + "TLS_V1_1",
              + "TLS_V1_2",
              + "TLS_V1_3",
            ]
        }

        timeouts {
            create = "180m"
            delete = "180m"
            update = "180m"
        }

      ~ waf_config {
            origin        = "primary"
          ~ origin_groups = [
              + "originGroups1",
            ]

          + access_rules {
              + action                       = "DETECT"
              + block_action                 = "SET_RESPONSE_CODE"
              + block_error_page_code        = "403"
              + block_error_page_description = "blockErrorPageDescription"
              + block_error_page_message     = "blockErrorPageMessage"
              + block_response_code          = 403
              + bypass_challenges            = (known after apply)
              + name                         = "DETECT_/"
              + redirect_response_code       = (known after apply)
              + redirect_url                 = (known after apply)

              + criteria {
                  + condition = "URL_IS"
                  + value     = "/"
                }
            }
          + access_rules {
              + action                       = "DETECT"
              + block_action                 = "SET_RESPONSE_CODE"
              + block_error_page_code        = "403"
              + block_error_page_description = "blockErrorPageDescription"
              + block_error_page_message     = "blockErrorPageMessage"
              + block_response_code          = 403
              + bypass_challenges            = (known after apply)
              + name                         = "DETECT_US"
              + redirect_response_code       = (known after apply)
              + redirect_url                 = (known after apply)

              + criteria {
                  + condition = "COUNTRY_IS"
                  + value     = "US"
                }
            }
          + access_rules {
              + action                       = "DETECT"
              + block_action                 = "SET_RESPONSE_CODE"
              + block_error_page_code        = "403"
              + block_error_page_description = "blockErrorPageDescription"
              + block_error_page_message     = "blockErrorPageMessage"
              + block_response_code          = 403
              + bypass_challenges            = (known after apply)
              + name                         = "DETECT_FR"
              + redirect_response_code       = (known after apply)
              + redirect_url                 = (known after apply)

              + criteria {
                  + condition = "COUNTRY_IS"
                  + value     = "FR"
                }
            }
          + access_rules {
              + action                       = "DETECT"
              + block_action                 = "SET_RESPONSE_CODE"
              + block_error_page_code        = "403"
              + block_error_page_description = "blockErrorPageDescription"
              + block_error_page_message     = "blockErrorPageMessage"
              + block_response_code          = 403
              + bypass_challenges            = (known after apply)
              + name                         = "DETECT_Mozilla"
              + redirect_response_code       = (known after apply)
              + redirect_url                 = (known after apply)

              + criteria {
                  + condition = "USER_AGENT_IS"
                  + value     = "Mozilla/5.0 (X11; Ubuntu; Linux x86_64; rv:35.0) Gecko/20100101 Firefox/35.0"
                }
            }

          ~ address_rate_limiting {
              ~ allowed_rate_per_address      = 1 -> 5
              ~ block_response_code           = 503 -> 403
              ~ is_enabled                    = false -> true
                max_delayed_count_per_address = 10
            }

          + caching_rules {
              + action                    = (known after apply)
              + caching_duration          = (known after apply)
              + client_caching_duration   = (known after apply)
              + is_client_caching_enabled = (known after apply)
              + key                       = (known after apply)
              + name                      = (known after apply)

              + criteria {
                  + condition = (known after apply)
                  + value     = (known after apply)
                }
            }

          + captchas {
              + failure_message               = (known after apply)
              + footer_text                   = (known after apply)
              + header_text                   = (known after apply)
              + session_expiration_in_seconds = (known after apply)
              + submit_label                  = (known after apply)
              + title                         = (known after apply)
              + url                           = (known after apply)
            }

          + custom_protection_rules {
              + action = (known after apply)
              + id     = (known after apply)
            }

          ~ device_fingerprint_challenge {
                action                                  = "DETECT"
              ~ action_expiration_in_seconds            = 60 -> 10
                failure_threshold                       = 10
              ~ failure_threshold_expiration_in_seconds = 60 -> 10
              ~ is_enabled                              = false -> true
              ~ max_address_count                       = 20 -> 10
              ~ max_address_count_expiration_in_seconds = 60 -> 10

              ~ challenge_settings {
                  ~ block_action                 = "SHOW_ERROR_PAGE" -> "SET_RESPONSE_CODE"
                  ~ block_error_page_code        = "DFC" -> "403"
                  ~ block_error_page_description = "Access blocked by website owner. Please contact support." -> "blockErrorPageDescription"
                  ~ block_error_page_message     = "Access to the website is blocked." -> "blockErrorPageMessage"
                    block_response_code          = 403
                  ~ captcha_footer               = "Enter the letters and numbers as they are shown in image above." -> "captchaFooter"
                  ~ captcha_header               = "We have detected an increased number of attempts to access this website. To help us keep this site secure, please let us know that you are not a robot by entering the text from the image below." -> "captchaHeader"
                  ~ captcha_submit_label         = "Yes, I am human." -> "captchaSubmitLabel"
                  ~ captcha_title                = "Are you human?" -> "captchaTitle"
                }
            }

          ~ human_interaction_challenge {
                action                                  = "DETECT"
              ~ action_expiration_in_seconds            = 60 -> 10
                failure_threshold                       = 10
              ~ failure_threshold_expiration_in_seconds = 60 -> 10
              ~ interaction_threshold                   = 3 -> 10
              ~ is_enabled                              = false -> true
              ~ recording_period_in_seconds             = 15 -> 10

              ~ challenge_settings {
                  ~ block_action                 = "SHOW_ERROR_PAGE" -> "SET_RESPONSE_CODE"
                  ~ block_error_page_code        = "HIC" -> "403"
                  ~ block_error_page_description = "Access blocked by website owner. Please contact support." -> "blockErrorPageDescription"
                  ~ block_error_page_message     = "Access to the website is blocked." -> "blockErrorPageMessage"
                    block_response_code          = 403
                  ~ captcha_footer               = "Enter the letters and numbers as they are shown in image above." -> "captchaFooter"
                  ~ captcha_header               = "We have detected an increased number of attempts to access this website. To help us keep this site secure, please let us know that you are not a robot by entering the text from the image below." -> "captchaHeader"
                  ~ captcha_submit_label         = "Yes, I am human." -> "captchaSubmitLabel"
                  ~ captcha_title                = "Are you human?" -> "captchaTitle"
                }

              + set_http_header {
                  + name  = "hc_name1"
                  + value = "hc_value1"
                }
            }

          ~ js_challenge {
                action                       = "DETECT"
              ~ action_expiration_in_seconds = 60 -> 10
                failure_threshold            = 10
              ~ is_enabled                   = false -> true

              ~ challenge_settings {
                  ~ block_action                 = "SHOW_ERROR_PAGE" -> "SET_RESPONSE_CODE"
                  ~ block_error_page_code        = "JSC-403" -> "403"
                  ~ block_error_page_description = "Access blocked by website owner. Please contact support." -> "blockErrorPageDescription"
                  ~ block_error_page_message     = "Access to the website is blocked." -> "blockErrorPageMessage"
                    block_response_code          = 403
                  ~ captcha_footer               = "Enter the letters and numbers as they are shown in image above." -> "captchaFooter"
                  ~ captcha_header               = "We have detected an increased number of attempts to access this website. To help us keep this site secure, please let us know that you are not a robot by entering the text from the image below." -> "captchaHeader"
                  ~ captcha_submit_label         = "Yes, I am human." -> "captchaSubmitLabel"
                  ~ captcha_title                = "Are you human?" -> "captchaTitle"
                }

              ~ set_http_header {
                  ~ name  = "x-jsc-alerts" -> (known after apply)
                  ~ value = "{failed_amount}" -> (known after apply)
                }
            }

          ~ protection_settings {
              ~ allowed_http_methods               = [
                  + "OPTIONS",
                    "GET",
                  - "POST",
                    "HEAD",
                  - "OPTIONS",
                  + "POST",
                  + "DELETE",
                  + "PUT",
                ]
                block_action                       = "SET_RESPONSE_CODE"
                block_error_page_code              = "403"
                block_error_page_description       = "Access blocked by website owner. Please contact support."
                block_error_page_message           = "Access to the website is blocked."
                block_response_code                = 403
                is_response_inspected              = false
              ~ max_argument_count                 = 255 -> 2
              ~ max_name_length_per_argument       = 400 -> 10
              ~ max_response_size_in_ki_b          = 1024 -> 10
              ~ max_total_name_length_of_arguments = 64000 -> 10
              ~ media_types                        = [
                    "text/html",
                    "text/plain",
                  + "text/asp",
                  + "application/json",
                  + "application/x-javascript",
                  + "application/javascript",
                  + "text/javascript",
                  + "application/xml",
                  + "text/xml",
                  + "application/plain",
                  + "application/json",
                ]
              ~ recommendations_period_in_days     = 10 -> 5
            }

          + whitelists {
              + addresses = (known after apply)
              + name      = (known after apply)
            }
        }
    }

  # oci_waas_waas_policy.student_waf_policy[2] must be replaced
-/+ resource "oci_waas_waas_policy" "student_waf_policy" {
      ~ additional_domains = [] -> (known after apply)
      ~ cname              = "student2-waf-oraclecloudpursuitlabs-com.b.waas.oci.oraclecloud.net" -> (known after apply)
        compartment_id     = "ocid1.compartment.oc1..aaaaaaaaec5to2hjrxvzpsybpo776hs25ybtqptkksjzxn4khlnqsvxjogpa"
      + defined_tags       = (known after apply)
        display_name       = "student2"
      ~ domain             = "student2-waf.oraclecloudpursuitlabs.com" -> "student2-waf.ORACLECLOUDPURSUITLABS.COM" # forces replacement
      ~ freeform_tags      = {} -> (known after apply)
      ~ id                 = "ocid1.waaspolicy.oc1..aaaaaaaaxjhg7sfeo5pxor6phjbmdhz3ep2co4atellzxadsrzqwlzgdu4cq" -> (known after apply)
      ~ state              = "ACTIVE" -> (known after apply)
      ~ time_created       = "2019-10-21 18:54:02.851 +0000 UTC" -> (known after apply)

      + origin_groups {
          + label = "originGroups1"

          + origin_group {
              + origin = "primary"
              + weight = 1
            }
        }

        origins {
            http_port  = 8000
            https_port = 4443
            label      = "primary"
            uri        = "158.101.175.177"

            custom_headers {
                name  = "user"
                value = "student"
            }
        }

      ~ policy_config {
            certificate_id                = "ocid1.waascertificate.oc1..aaaaaaaao4fg75q3ftv3dui6h4ttds52cpi3ktn6zo5b6xu4vivatqhvr5ka"
          + cipher_group                  = "DEFAULT"
            client_address_header         = "X_FORWARDED_FOR"
            is_behind_cdn                 = false
          ~ is_cache_control_respected    = false -> true
            is_https_enabled              = true
            is_https_forced               = true
            is_origin_compression_enabled = false
            is_response_buffering_enabled = false
          ~ tls_protocols                 = [
              + "TLS_V1",
              + "TLS_V1_1",
              + "TLS_V1_2",
              + "TLS_V1_3",
            ]
        }

        timeouts {
            create = "180m"
            delete = "180m"
            update = "180m"
        }

      ~ waf_config {
            origin        = "primary"
          ~ origin_groups = [
              + "originGroups1",
            ]

          + access_rules {
              + action                       = "DETECT"
              + block_action                 = "SET_RESPONSE_CODE"
              + block_error_page_code        = "403"
              + block_error_page_description = "blockErrorPageDescription"
              + block_error_page_message     = "blockErrorPageMessage"
              + block_response_code          = 403
              + bypass_challenges            = (known after apply)
              + name                         = "DETECT_/"
              + redirect_response_code       = (known after apply)
              + redirect_url                 = (known after apply)

              + criteria {
                  + condition = "URL_IS"
                  + value     = "/"
                }
            }
          + access_rules {
              + action                       = "DETECT"
              + block_action                 = "SET_RESPONSE_CODE"
              + block_error_page_code        = "403"
              + block_error_page_description = "blockErrorPageDescription"
              + block_error_page_message     = "blockErrorPageMessage"
              + block_response_code          = 403
              + bypass_challenges            = (known after apply)
              + name                         = "DETECT_US"
              + redirect_response_code       = (known after apply)
              + redirect_url                 = (known after apply)

              + criteria {
                  + condition = "COUNTRY_IS"
                  + value     = "US"
                }
            }
          + access_rules {
              + action                       = "DETECT"
              + block_action                 = "SET_RESPONSE_CODE"
              + block_error_page_code        = "403"
              + block_error_page_description = "blockErrorPageDescription"
              + block_error_page_message     = "blockErrorPageMessage"
              + block_response_code          = 403
              + bypass_challenges            = (known after apply)
              + name                         = "DETECT_FR"
              + redirect_response_code       = (known after apply)
              + redirect_url                 = (known after apply)

              + criteria {
                  + condition = "COUNTRY_IS"
                  + value     = "FR"
                }
            }
          + access_rules {
              + action                       = "DETECT"
              + block_action                 = "SET_RESPONSE_CODE"
              + block_error_page_code        = "403"
              + block_error_page_description = "blockErrorPageDescription"
              + block_error_page_message     = "blockErrorPageMessage"
              + block_response_code          = 403
              + bypass_challenges            = (known after apply)
              + name                         = "DETECT_Mozilla"
              + redirect_response_code       = (known after apply)
              + redirect_url                 = (known after apply)

              + criteria {
                  + condition = "USER_AGENT_IS"
                  + value     = "Mozilla/5.0 (X11; Ubuntu; Linux x86_64; rv:35.0) Gecko/20100101 Firefox/35.0"
                }
            }

          ~ address_rate_limiting {
              ~ allowed_rate_per_address      = 1 -> 5
              ~ block_response_code           = 503 -> 403
              ~ is_enabled                    = false -> true
                max_delayed_count_per_address = 10
            }

          + caching_rules {
              + action                    = (known after apply)
              + caching_duration          = (known after apply)
              + client_caching_duration   = (known after apply)
              + is_client_caching_enabled = (known after apply)
              + key                       = (known after apply)
              + name                      = (known after apply)

              + criteria {
                  + condition = (known after apply)
                  + value     = (known after apply)
                }
            }

          + captchas {
              + failure_message               = (known after apply)
              + footer_text                   = (known after apply)
              + header_text                   = (known after apply)
              + session_expiration_in_seconds = (known after apply)
              + submit_label                  = (known after apply)
              + title                         = (known after apply)
              + url                           = (known after apply)
            }

          + custom_protection_rules {
              + action = (known after apply)
              + id     = (known after apply)
            }

          ~ device_fingerprint_challenge {
                action                                  = "DETECT"
              ~ action_expiration_in_seconds            = 60 -> 10
                failure_threshold                       = 10
              ~ failure_threshold_expiration_in_seconds = 60 -> 10
              ~ is_enabled                              = false -> true
              ~ max_address_count                       = 20 -> 10
              ~ max_address_count_expiration_in_seconds = 60 -> 10

              ~ challenge_settings {
                  ~ block_action                 = "SHOW_ERROR_PAGE" -> "SET_RESPONSE_CODE"
                  ~ block_error_page_code        = "DFC" -> "403"
                  ~ block_error_page_description = "Access blocked by website owner. Please contact support." -> "blockErrorPageDescription"
                  ~ block_error_page_message     = "Access to the website is blocked." -> "blockErrorPageMessage"
                    block_response_code          = 403
                  ~ captcha_footer               = "Enter the letters and numbers as they are shown in image above." -> "captchaFooter"
                  ~ captcha_header               = "We have detected an increased number of attempts to access this website. To help us keep this site secure, please let us know that you are not a robot by entering the text from the image below." -> "captchaHeader"
                  ~ captcha_submit_label         = "Yes, I am human." -> "captchaSubmitLabel"
                  ~ captcha_title                = "Are you human?" -> "captchaTitle"
                }
            }

          ~ human_interaction_challenge {
                action                                  = "DETECT"
              ~ action_expiration_in_seconds            = 60 -> 10
                failure_threshold                       = 10
              ~ failure_threshold_expiration_in_seconds = 60 -> 10
              ~ interaction_threshold                   = 3 -> 10
              ~ is_enabled                              = false -> true
              ~ recording_period_in_seconds             = 15 -> 10

              ~ challenge_settings {
                  ~ block_action                 = "SHOW_ERROR_PAGE" -> "SET_RESPONSE_CODE"
                  ~ block_error_page_code        = "HIC" -> "403"
                  ~ block_error_page_description = "Access blocked by website owner. Please contact support." -> "blockErrorPageDescription"
                  ~ block_error_page_message     = "Access to the website is blocked." -> "blockErrorPageMessage"
                    block_response_code          = 403
                  ~ captcha_footer               = "Enter the letters and numbers as they are shown in image above." -> "captchaFooter"
                  ~ captcha_header               = "We have detected an increased number of attempts to access this website. To help us keep this site secure, please let us know that you are not a robot by entering the text from the image below." -> "captchaHeader"
                  ~ captcha_submit_label         = "Yes, I am human." -> "captchaSubmitLabel"
                  ~ captcha_title                = "Are you human?" -> "captchaTitle"
                }

              + set_http_header {
                  + name  = "hc_name1"
                  + value = "hc_value1"
                }
            }

          ~ js_challenge {
                action                       = "DETECT"
              ~ action_expiration_in_seconds = 60 -> 10
                failure_threshold            = 10
              ~ is_enabled                   = false -> true

              ~ challenge_settings {
                  ~ block_action                 = "SHOW_ERROR_PAGE" -> "SET_RESPONSE_CODE"
                  ~ block_error_page_code        = "JSC-403" -> "403"
                  ~ block_error_page_description = "Access blocked by website owner. Please contact support." -> "blockErrorPageDescription"
                  ~ block_error_page_message     = "Access to the website is blocked." -> "blockErrorPageMessage"
                    block_response_code          = 403
                  ~ captcha_footer               = "Enter the letters and numbers as they are shown in image above." -> "captchaFooter"
                  ~ captcha_header               = "We have detected an increased number of attempts to access this website. To help us keep this site secure, please let us know that you are not a robot by entering the text from the image below." -> "captchaHeader"
                  ~ captcha_submit_label         = "Yes, I am human." -> "captchaSubmitLabel"
                  ~ captcha_title                = "Are you human?" -> "captchaTitle"
                }

              ~ set_http_header {
                  ~ name  = "x-jsc-alerts" -> (known after apply)
                  ~ value = "{failed_amount}" -> (known after apply)
                }
            }

          ~ protection_settings {
              ~ allowed_http_methods               = [
                  + "OPTIONS",
                    "GET",
                  - "POST",
                    "HEAD",
                  - "OPTIONS",
                  + "POST",
                  + "DELETE",
                  + "PUT",
                ]
                block_action                       = "SET_RESPONSE_CODE"
                block_error_page_code              = "403"
                block_error_page_description       = "Access blocked by website owner. Please contact support."
                block_error_page_message           = "Access to the website is blocked."
                block_response_code                = 403
                is_response_inspected              = false
              ~ max_argument_count                 = 255 -> 2
              ~ max_name_length_per_argument       = 400 -> 10
              ~ max_response_size_in_ki_b          = 1024 -> 10
              ~ max_total_name_length_of_arguments = 64000 -> 10
              ~ media_types                        = [
                    "text/html",
                    "text/plain",
                  + "text/asp",
                  + "application/json",
                  + "application/x-javascript",
                  + "application/javascript",
                  + "text/javascript",
                  + "application/xml",
                  + "text/xml",
                  + "application/plain",
                  + "application/json",
                ]
              ~ recommendations_period_in_days     = 10 -> 5
            }

          + whitelists {
              + addresses = (known after apply)
              + name      = (known after apply)
            }
        }
    }

Plan: 3 to add, 3 to change, 3 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.